In [1]:
import sqlite3
import pandas as pd

In [43]:
con = sqlite3.connect("nba.db")
df = pd.read_sql_query("SELECT TEAM, AVG(AGE) from nba_2017_pie GROUP BY TEAM", con)

In [44]:
df.head()

  TEAM   AVG(AGE)
0  ATL  28.500000
1  BKN  26.555556
2  BOS  25.733333
3  CHA  25.823529
4  CHI  26.000000

In [34]:
df1 = df.groupby("TEAM").mean()

In [35]:
df1.head()

            AGE
TEAM
ATL   28.500000
BKN   26.555556
BOS   25.733333
CHA   25.823529
CHI   26.000000

In [36]:
values = df1["AGE"].values.tolist()

In [37]:
print(values)

[28.5, 26.555555555555557, 25.733333333333334, 25.823529411764707, 26.0, 30.42105263157895, 27.263157894736842, 26.352941176470587, 25.933333333333334, 28.625, 26.466666666666665, 27.5, 30.066666666666666, 26.5, 27.8125, 27.357142857142858, 26.294117647058822, 26.133333333333333, 26.88235294117647, 27.266666666666666, 26.133333333333333, 25.77777777777778, 25.1875, 25.58823529411765, 24.571428571428573, 26.4375, 29.0, 25.6875, 26.733333333333334, 26.058823529411764]